//Пропонуємо Вам виконати тестове завдання (виконати потрібно на Java). Якщо Ви успішно впораєтеся, ми з радістю запросимо Вас на співбесіду. На виконання тестового завдання у Вас є один тиждень.
//
//
//        Необхідно описати завдання із застосуванням принципів ООП.
//
//
//        Умова тестового завдання:
//
//        Подано об'єкти-фігури таких видів: квадрат, трикутник, коло та трапеція. Кожну фігуру можна намалювати, отримати параметри її площі і колір. Також фігури мають унікальні методи, наприклад, повернути радіус, довжину гіпотенузи, довжину сторони і т. д.
//
//        Нам необхідно згенерувати випадковий набір фігур, кількість об'єктів у наборі також заздалегідь невідома.
//
//        Після генерації масиву потрібно вивести весь список об'єктів, які у нас є, наприклад:
//
//        Фігура: квадрат, площа: 25 кв. од., довжина сторони: 5 од., колір: синій.
//
//        Фігура: трикутник, площа: 12,5 кв.од., гіпотенуза: 7.1 од., колір: жовтий.
//
//        ...
//
//        Вихідний код завантажте на один із сервісів контролю версій (GitHub, Bitbucket). Посилання на репозиторій надішліть на поштову скриньку: jobs@testmatick.com.
